hananddong/ble_uwb_code/UWB_BLE_nrf52832/modules/nrfx/hal/nrf_usbd.h
    @retval true If the event was set.
    @retval false If the event was not set.
*/
__STATIC_INLINE bool nrf_usbd_event_get_and_clear(nrf_usbd_event_t event);

/**
    @brief Function for returning the address of a specific USBD event register.

    @param     event  Event.

    @return Address.
*/
__STATIC_INLINE uint32_t nrf_usbd_event_address_get(nrf_usbd_event_t event);

/**
    @brief Function for setting a shortcut.

    @param     short_mask Shortcuts mask.
*/
__STATIC_INLINE void nrf_usbd_shorts_enable(uint32_t short_mask);

/**
    @brief Function for clearing shortcuts.

    @param     short_mask Shortcuts mask.
*/
__STATIC_INLINE void nrf_usbd_shorts_disable(uint32_t short_mask);

/**
    @brief Get the shorts mask

    Function returns shorts register.

    @return Flags of currently enabled shortcuts
*/
__STATIC_INLINE uint32_t nrf_usbd_shorts_get(void);

/**
    @brief Function for enabling selected interrupts.

    @param     int_mask Interrupts mask.
*/
__STATIC_INLINE void nrf_usbd_int_enable(uint32_t int_mask);

/**
    @brief Function for retrieving the state of selected interrupts.

    @param     int_mask Interrupts mask.

    @retval true If any of selected interrupts is enabled.
    @retval false If none of selected interrupts is enabled.
*/
__STATIC_INLINE bool nrf_usbd_int_enable_check(uint32_t int_mask);

/**
    @brief Function for retrieving the information about enabled interrupts.

    @return The flags of enabled interrupts.
*/
__STATIC_INLINE uint32_t nrf_usbd_int_enable_get(void);

/**
    @brief Function for disabling selected interrupts.

    @param     int_mask Interrupts mask.
*/
__STATIC_INLINE void nrf_usbd_int_disable(uint32_t int_mask);


/** @} */ /*  End of nrf_usbd_hal */


#ifndef SUPPRESS_INLINE_IMPLEMENTATION

/*  ------------------------------------------------------------------------------------------------
    Internal functions
*/

/**
    @internal
    @brief Internal function for getting task/event register address

    @oaram offset Offset of the register from the instance beginning

    @attention offset has to be modulo 4 value. In other case we can get hardware fault.
    @return Pointer to the register
*/
__STATIC_INLINE volatile uint32_t *nrf_usbd_getRegPtr(uint32_t offset)
{
    return (volatile uint32_t *)(((uint8_t *)NRF_USBD) + (uint32_t)offset);
}

/**
    @internal
    @brief Internal function for getting task/event register address - constant version

    @oaram offset Offset of the register from the instance beginning

    @attention offset has to be modulo 4 value. In other case we can get hardware fault.
    @return Pointer to the register
*/
__STATIC_INLINE volatile const uint32_t *nrf_usbd_getRegPtr_c(uint32_t offset)
{
    return (volatile const uint32_t *)(((uint8_t *)NRF_USBD) + (uint32_t)offset);
}

/*  ------------------------------------------------------------------------------------------------
    Interface functions definitions
*/

void nrf_usbd_task_trigger(nrf_usbd_task_t task)
{
    *(nrf_usbd_getRegPtr((uint32_t)task)) = 1UL;
    __ISB();
    __DSB();
}

uint32_t nrf_usbd_task_address_get(nrf_usbd_task_t task)
{
    return (uint32_t)nrf_usbd_getRegPtr_c((uint32_t)task);
}

void nrf_usbd_event_clear(nrf_usbd_event_t event)
{
    *(nrf_usbd_getRegPtr((uint32_t)event)) = 0UL;
    __ISB();
    __DSB();
}

bool nrf_usbd_event_check(nrf_usbd_event_t event)
{
    return (bool) * nrf_usbd_getRegPtr_c((uint32_t)event);
}

bool nrf_usbd_event_get_and_clear(nrf_usbd_event_t event)
{
    bool ret = nrf_usbd_event_check(event);
    
    if(ret)
        nrf_usbd_event_clear(event);
        
    return ret;
}

uint32_t nrf_usbd_event_address_get(nrf_usbd_event_t event)
{
    return (uint32_t)nrf_usbd_getRegPtr_c((uint32_t)event);
}

void nrf_usbd_shorts_enable(uint32_t short_mask)
{
    NRF_USBD->SHORTS |= short_mask;
}

void nrf_usbd_shorts_disable(uint32_t short_mask)
{
    if(~0U == short_mask)
    {
        /* Optimized version for "disable all" */
        NRF_USBD->SHORTS = 0;
    }
    
    else
        NRF_USBD->SHORTS &= ~short_mask;
}

uint32_t nrf_usbd_shorts_get(void)
{
    return NRF_USBD->SHORTS;
}

void nrf_usbd_int_enable(uint32_t int_mask)
{
    NRF_USBD->INTENSET = int_mask;
}

bool nrf_usbd_int_enable_check(uint32_t int_mask)
{
    return !!(NRF_USBD->INTENSET & int_mask);
}

uint32_t nrf_usbd_int_enable_get(void)
{
    return NRF_USBD->INTENSET;
}

void nrf_usbd_int_disable(uint32_t int_mask)
{
    NRF_USBD->INTENCLR = int_mask;
}

#endif /* SUPPRESS_INLINE_IMPLEMENTATION */

/*  ------------------------------------------------------------------------------------------------
    End of automatically generated part
    ------------------------------------------------------------------------------------------------
*/
/**
    @addtogroup nrf_usbd_hal
    @{
*/

/**
    @brief Frame counter size

    The number of counts that can be fitted into frame counter
*/
#define NRF_USBD_FRAMECNTR_SIZE \
    ( (USBD_FRAMECNTR_FRAMECNTR_Msk >> USBD_FRAMECNTR_FRAMECNTR_Pos) + 1UL )
#ifndef USBD_FRAMECNTR_FRAMECNTR_Msk
#error USBD_FRAMECNTR_FRAMECNTR_Msk should be changed into USBD_FRAMECNTR_FRAMECNTR_Msk
#endif

/**
    @brief First isochronous endpoint number

    The number of the first isochronous endpoint
*/
#define NRF_USBD_EPISO_FIRST 8

/**
    @brief Total number of IN endpoints

    Total number of IN endpoint (including ISOCHRONOUS).
*/
#define NRF_USBD_EPIN_CNT 9

/**
    @brief Total number of OUT endpoints

    Total number of OUT endpoint (including ISOCHRONOUS).
*/
#define NRF_USBD_EPOUT_CNT 9

/**
    @brief Mask of the direction bit in endpoint number
*/
#define NRF_USBD_EP_DIR_Msk (1U << 7)

/**
    @brief The value of direction bit for IN endpoint direction
*/
#define NRF_USBD_EP_DIR_IN  (1U << 7)

/**
    @brief The value of direction bit for OUT endpoint direction
*/
#define NRF_USBD_EP_DIR_OUT (0U << 7)

/**
    @brief Macro for making IN endpoint identifier from endpoint number

    Macro that sets direction bit to make IN endpoint
    @param[in] epnr Endpoint number
    @return IN Endpoint identifier
*/
#define NRF_USBD_EPIN(epnr)  (((uint8_t)(epnr)) | NRF_USBD_EP_DIR_IN)

/**
    @brief Macro for making OUT endpoint identifier from endpoint number

    Macro that sets direction bit to make OUT endpoint
    @param[in] epnr Endpoint number
    @return OUT Endpoint identifier
*/
#define NRF_USBD_EPOUT(epnr) (((uint8_t)(epnr)) | NRF_USBD_EP_DIR_OUT)

/**
    @brief Macro for extracting the endpoint number from endpoint identifier

    Macro that strips out the information about endpoint direction.
    @param[in] ep Endpoint identifier
    @return Endpoint number
*/
#define NRF_USBD_EP_NR_GET(ep) ((uint8_t)(((uint8_t)(ep)) & 0xFU))

/**
    @brief Macro for checking endpoint direction

