hananddong/ble_uwb_code/UWB_BLE_nrf52832/modules/nrfx/hal/nrf_usbd.h
    @return Flag values defined in @ref nrf_usbd_eventcause_mask_t
*/
__STATIC_INLINE uint32_t nrf_usbd_eventcause_get(void);

/**
    @brief Function for clearing EVENTCAUSE flags

    @param flags Flags defined in @ref nrf_usbd_eventcause_mask_t
*/
__STATIC_INLINE void nrf_usbd_eventcause_clear(uint32_t flags);

/**
    @brief Function for getting EVENTCAUSE register and clear flags that are set

    The safest way to return current EVENTCAUSE register.
    All the flags that are returned would be cleared inside EVENTCAUSE register.

    @return Flag values defined in @ref nrf_usbd_eventcause_mask_t
*/
__STATIC_INLINE uint32_t nrf_usbd_eventcause_get_and_clear(void);

/**
    @brief Function for getting HALTEDEPIN register value

    @param ep Endpoint number with IN/OUT flag

    @return The value of HALTEDEPIN or HALTEDOUT register for selected endpoint

    @note
    Use this function for the response for GetStatus() request to endpoint.
    To check if endpoint is stalled in the code use @ref nrf_usbd_ep_is_stall.
*/
__STATIC_INLINE uint32_t nrf_usbd_haltedep(uint8_t ep);

/**
    @brief Function for checking if selected endpoint is stalled

    Function to be used as a syntax sweeter for @ref nrf_usbd_haltedep.

    Also as the isochronous endpoint cannot be halted - it returns always false
    if isochronous endpoint is checked.

    @param ep Endpoint number with IN/OUT flag

    @return The information if the enepoint is halted.
*/
__STATIC_INLINE bool nrf_usbd_ep_is_stall(uint8_t ep);

/**
    @brief Function for getting EPSTATUS register value

    @return Flag values defined in @ref nrf_usbd_epstatus_mask_t
*/
__STATIC_INLINE uint32_t nrf_usbd_epstatus_get(void);

/**
    @brief Function for clearing EPSTATUS register value

    @param flags Flags defined in @ref nrf_usbd_epstatus_mask_t
*/
__STATIC_INLINE void nrf_usbd_epstatus_clear(uint32_t flags);

/**
    @brief Function for getting and clearing EPSTATUS register value

    Function clears all flags in register set before returning its value.
    @return Flag values defined in @ref nrf_usbd_epstatus_mask_t
*/
__STATIC_INLINE uint32_t nrf_usbd_epstatus_get_and_clear(void);

/**
    @brief Function for getting DATAEPSTATUS register value

    @return Flag values defined in @ref nrf_usbd_dataepstatus_mask_t
*/
__STATIC_INLINE uint32_t nrf_usbd_epdatastatus_get(void);

/**
    @brief Function for clearing DATAEPSTATUS register value

    @param flags Flags defined in @ref nrf_usbd_dataepstatus_mask_t
*/
__STATIC_INLINE void nrf_usbd_epdatastatus_clear(uint32_t flags);

/**
    @brief Function for getting and clearing DATAEPSTATUS register value

    Function clears all flags in register set before returning its value.
    @return Flag values defined in @ref nrf_usbd_dataepstatus_mask_t
*/
__STATIC_INLINE uint32_t nrf_usbd_epdatastatus_get_and_clear(void);

/**
    @name Setup command frame functions

    Functions for setup command frame parts access
    @{
*/
/**
    @brief Function for reading BMREQUESTTYPE - part of SETUP packet

    @return the value of BREQUESTTYPE on last received SETUP frame
*/
__STATIC_INLINE uint8_t nrf_usbd_setup_bmrequesttype_get(void);

/**
    @brief Function for reading BMREQUEST - part of SETUP packet

    @return the value of BREQUEST on last received SETUP frame
*/
__STATIC_INLINE uint8_t nrf_usbd_setup_brequest_get(void);

/**
    @brief Function for reading WVALUE - part of SETUP packet

    @return the value of WVALUE on last received SETUP frame
*/
__STATIC_INLINE uint16_t nrf_usbd_setup_wvalue_get(void);

/**
    @brief Function for reading WINDEX - part of SETUP packet

    @return the value of WINDEX on last received SETUP frame
*/
__STATIC_INLINE uint16_t nrf_usbd_setup_windex_get(void);

/**
    @brief Function for reading WLENGTH - part of SETUP packet

    @return the value of WLENGTH on last received SETUP frame
*/
__STATIC_INLINE uint16_t nrf_usbd_setup_wlength_get(void);
/** @} */

/**
    @brief Function for getting number of received bytes on selected endpoint

    @param ep Endpoint identifier.

    @return Number of received bytes.

    @note This function may be used on Bulk/Interrupt and Isochronous endpoints.
    @note For the function that returns different value for ISOOUT zero transfer or no transfer at all,
         see @ref nrf_usbd_episoout_size_get function. This function would return 0 for both cases.
*/
__STATIC_INLINE size_t nrf_usbd_epout_size_get(uint8_t ep);

/**
    @brief Function for getting number of received bytes on isochronous endpoint.

    @param ep Endpoint identifier, has to be isochronous out endpoint.

    @return Number of bytes received or @ref NRF_USBD_EPISOOUT_NO_DATA
*/
__STATIC_INLINE size_t nrf_usbd_episoout_size_get(uint8_t ep);

/**
    @brief Function for clearing out endpoint to accept any new incoming traffic

    @param ep ep Endpoint identifier. Only OUT Interrupt/Bulk endpoints are accepted.
*/
__STATIC_INLINE void nrf_usbd_epout_clear(uint8_t ep);

/**
    @brief Function for enabling USB pullup
*/
__STATIC_INLINE void nrf_usbd_pullup_enable(void);

/**
    @brief Function for disabling USB pullup
*/
__STATIC_INLINE void nrf_usbd_pullup_disable(void);

/**
    @brief Function for returning current USB pullup state

    @retval true  USB pullup is enabled
    @retval false USB pullup is disabled
*/
__STATIC_INLINE bool nrf_usbd_pullup_check(void);

/**
    @brief Function for configuring the value to be forced on the bus on DRIVEDPDM task

    Selected state would be forced on the bus when @ref NRF_USBD_TASK_DRIVEDPDM is set.
    The state would be removed from the bus on @ref NRF_USBD_TASK_NODRIVEDPDM and
    the control would be returned to the USBD peripheral.
    @param val State to be set
*/
__STATIC_INLINE void nrf_usbd_dpdmvalue_set(nrf_usbd_dpdmvalue_t val);

/**
    @brief Function for setting data toggle

    Configuration of current state of data toggling
    @param ep Endpoint number with the information about its direction
    @param op Operation to execute
*/
__STATIC_INLINE void nrf_usbd_dtoggle_set(uint8_t ep, nrf_usbd_dtoggle_t op);

/**
    @brief Function for getting data toggle

    Get the current state of data toggling
    @param ep Endpoint number to return the information about current data toggling
    @retval NRF_USBD_DTOGGLE_DATA0 Data toggle is DATA0 on selected endpoint
    @retval NRF_USBD_DTOGGLE_DATA1 Data toggle is DATA1 on selected endpoint
*/
__STATIC_INLINE nrf_usbd_dtoggle_t nrf_usbd_dtoggle_get(uint8_t ep);

/**
    @brief Function for checking if endpoint is enabled

