hananddong/ble_uwb_code/UWB_BLE_nrf52832/modules/nrfx/hal/nrf_usbd.h
    @param ep Endpoint id to check

    @retval true  Endpoint is enabled
    @retval false Endpoint is disabled
*/
__STATIC_INLINE bool nrf_usbd_ep_enable_check(uint8_t ep);

/**
    @brief Function for enabling selected endpoint

    Enabled endpoint responds for the tokens on the USB bus

    @param ep Endpoint id to enable
*/
__STATIC_INLINE void nrf_usbd_ep_enable(uint8_t ep);

/**
    @brief Function for disabling selected endpoint

    Disabled endpoint does not respond for the tokens on the USB bus

    @param ep Endpoint id to disable
*/
__STATIC_INLINE void nrf_usbd_ep_disable(uint8_t ep);

/**
    @brief Function for disabling all endpoints

    Auxiliary function to simply disable all aviable endpoints.
    It lefts only EP0 IN and OUT enabled.
*/
__STATIC_INLINE void nrf_usbd_ep_all_disable(void);

/**
    @brief Function for stalling selected endpoint

    @param ep Endpoint identifier
    @note This function cannot be called on isochronous endpoint
*/
__STATIC_INLINE void nrf_usbd_ep_stall(uint8_t ep);

/**
    @brief Function for unstalling selected endpoint

    @param ep Endpoint identifier
    @note This function cannot be called on isochronous endpoint
*/
__STATIC_INLINE void nrf_usbd_ep_unstall(uint8_t ep);

/**
    @brief Function for configuration of isochronous buffer splitting

    Configure isochronous buffer splitting between IN and OUT endpoints.

    @param split Required configuration
*/
__STATIC_INLINE void nrf_usbd_isosplit_set(nrf_usbd_isosplit_t split);

/**
    @brief Function for getting the isochronous buffer splitting configuration

    Get the current isochronous buffer splitting configuration.

    @return Current configuration
*/
__STATIC_INLINE nrf_usbd_isosplit_t nrf_usbd_isosplit_get(void);

/**
    @brief Function for getting current frame counter

    @return Current frame counter
*/
__STATIC_INLINE uint32_t nrf_usbd_framecntr_get(void);

/**
    @brief Function for entering into low power mode

    After this function is called the clock source from the USBD is disconnected internally.
    After this function is called most of the USBD registers cannot be accessed anymore.

    @sa nrf_usbd_lowpower_disable
    @sa nrf_usbd_lowpower_check
*/
__STATIC_INLINE void nrf_usbd_lowpower_enable(void);

/**
    @brief Function for exiting from low power mode

    After this function is called the clock source for the USBD is connected internally.
    The @ref NRF_USBD_EVENTCAUSE_WUREQ_MASK event would be generated and
    then the USBD registers may be accessed.

    @sa nrf_usbd_lowpower_enable
    @sa nrf_usbd_lowpower_check
*/
__STATIC_INLINE void nrf_usbd_lowpower_disable(void);

/**
    @brief Function for checking the state of the low power mode

    @retval true  USBD is in low power mode
    @retval false USBD is not in low power mode
*/
__STATIC_INLINE bool nrf_usbd_lowpower_check(void);

/**
    @brief Function for configuring ISO IN endpoint response to an IN token when no data is ready to be sent.

    @param config Required configuration
*/
__STATIC_INLINE void nrf_usbd_isoinconfig_set(nrf_usbd_isoinconfig_t config);

/**
    @brief Function for getting the cofiguration of ISO IN endpoint response to an IN token when no data is ready to be sent.

    @return Current configuration
*/
__STATIC_INLINE nrf_usbd_isoinconfig_t nrf_usbd_isoinconfig_get(void);

/**
    @brief Function for configuring EasyDMA channel

    Configures EasyDMA for the transfer.

    @param ep     Endpoint identifier (with direction)
    @param ptr    Pointer to the data
    @param maxcnt Number of bytes to transfer
*/
__STATIC_INLINE void nrf_usbd_ep_easydma_set(uint8_t ep, uint32_t ptr, uint32_t maxcnt);

/**
    @brief Function for getting number of transferred bytes

    Get number of transferred bytes in the last transaction

    @param ep Endpoint identifier

    @return The content of the AMOUNT register
*/
__STATIC_INLINE uint32_t nrf_usbd_ep_amount_get(uint8_t ep);


#ifndef SUPPRESS_INLINE_IMPLEMENTATION

void nrf_usbd_enable(void)
{
    #ifdef NRF_FPGA_IMPLEMENTATION
    *(volatile uint32_t *)0x400005F4 = 3;
    __ISB();
    __DSB();
    *(volatile uint32_t *)0x400005F0 = 3;
    __ISB();
    __DSB();
    #endif
    
    NRF_USBD->ENABLE = USBD_ENABLE_ENABLE_Enabled << USBD_ENABLE_ENABLE_Pos;
    __ISB();
    __DSB();
}

void nrf_usbd_disable(void)
{
    NRF_USBD->ENABLE = USBD_ENABLE_ENABLE_Disabled << USBD_ENABLE_ENABLE_Pos;
    __ISB();
    __DSB();
}

uint32_t nrf_usbd_eventcause_get(void)
{
    return NRF_USBD->EVENTCAUSE;
}

void nrf_usbd_eventcause_clear(uint32_t flags)
{
    NRF_USBD->EVENTCAUSE = flags;
    __ISB();
    __DSB();
}

uint32_t nrf_usbd_eventcause_get_and_clear(void)
{
    uint32_t ret;
    ret = nrf_usbd_eventcause_get();
    nrf_usbd_eventcause_clear(ret);
    __ISB();
    __DSB();
    return ret;
}

uint32_t nrf_usbd_haltedep(uint8_t ep)
{
    uint8_t epnr = NRF_USBD_EP_NR_GET(ep);
    
    if(NRF_USBD_EPIN_CHECK(ep))
    {
        NRFX_ASSERT(epnr < ARRAY_SIZE(NRF_USBD->HALTED.EPIN));
        return NRF_USBD->HALTED.EPIN[epnr];
    }
    
    else
    {
        NRFX_ASSERT(epnr < ARRAY_SIZE(NRF_USBD->HALTED.EPOUT));
        return NRF_USBD->HALTED.EPOUT[epnr];
    }
}

bool nrf_usbd_ep_is_stall(uint8_t ep)
{
    if(NRF_USBD_EPISO_CHECK(ep))
        return false;
        
    return USBD_HALTED_EPOUT_GETSTATUS_Halted == nrf_usbd_haltedep(ep);
}

uint32_t nrf_usbd_epstatus_get(void)
{
    return NRF_USBD->EPSTATUS;
}

void nrf_usbd_epstatus_clear(uint32_t flags)
{
    NRF_USBD->EPSTATUS = flags;
    __ISB();
    __DSB();
}

uint32_t nrf_usbd_epstatus_get_and_clear(void)
{
    uint32_t ret;
    ret = nrf_usbd_epstatus_get();
    nrf_usbd_epstatus_clear(ret);
    return ret;
}

uint32_t nrf_usbd_epdatastatus_get(void)
{
    return NRF_USBD->EPDATASTATUS;
}

void nrf_usbd_epdatastatus_clear(uint32_t flags)
{
    NRF_USBD->EPDATASTATUS = flags;
    __ISB();
    __DSB();
}

uint32_t nrf_usbd_epdatastatus_get_and_clear(void)
{
    uint32_t ret;
    ret = nrf_usbd_epdatastatus_get();
    nrf_usbd_epdatastatus_clear(ret);
    return ret;
}

